# FObject

## Description
Function FObject returns a handle to the first object in the active document. If the document is empty, the function returns NIL.&lt;BR&gt;
&lt;BR&gt;

```pascal
FUNCTION FObject : HANDLE;
```

```python

def vs.FObject():
    return HANDLE
```

## Version
Availability: from MiniCAD
## Category
* Document List Handling